SpaceTrekKSC/ExoNaut_ESP32/hardware/exonaut/esp32/boards.txt
# Essential menu definitions
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.EraseFlash=Erase All Flash Before Sketch Upload

# This defines the name that will replace "ESP32 Arduino (in Sketchbook)"
exonaut_esp32.platform=ExoNaut

# Custom board definition
exonaut_esp32.name=ExoNaut_ESP32

exonaut_esp32.bootloader.tool=esptool_py
exonaut_esp32.bootloader.tool.default=esptool_py

exonaut_esp32.upload.tool=esptool_py
exonaut_esp32.upload.tool.default=esptool_py
exonaut_esp32.upload.tool.network=esp_ota

exonaut_esp32.upload.maximum_size=1310720
exonaut_esp32.upload.maximum_data_size=327680
exonaut_esp32.upload.flags=
exonaut_esp32.upload.extra_flags=

exonaut_esp32.serial.disableDTR=true
exonaut_esp32.serial.disableRTS=true

exonaut_esp32.build.tarch=xtensa
exonaut_esp32.build.bootloader_addr=0x1000
exonaut_esp32.build.target=esp32
exonaut_esp32.build.mcu=esp32
exonaut_esp32.build.core=esp32
exonaut_esp32.build.variant=esp32
exonaut_esp32.build.board=ESP32_DEV

exonaut_esp32.build.f_cpu=240000000L
exonaut_esp32.build.flash_size=4MB
exonaut_esp32.build.flash_freq=40m
exonaut_esp32.build.flash_mode=dio
exonaut_esp32.build.boot=dio
exonaut_esp32.build.partitions=default
exonaut_esp32.build.defines=

# CPU Frequency options
exonaut_esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
exonaut_esp32.menu.CPUFreq.240.build.f_cpu=240000000L
exonaut_esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
exonaut_esp32.menu.CPUFreq.160.build.f_cpu=160000000L
exonaut_esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
exonaut_esp32.menu.CPUFreq.80.build.f_cpu=80000000L

# Flash Mode
exonaut_esp32.menu.FlashMode.qio=QIO
exonaut_esp32.menu.FlashMode.qio.build.flash_mode=dio
exonaut_esp32.menu.FlashMode.qio.build.boot=qio
exonaut_esp32.menu.FlashMode.dio=DIO
exonaut_esp32.menu.FlashMode.dio.build.flash_mode=dio
exonaut_esp32.menu.FlashMode.dio.build.boot=dio

# Flash Frequency
exonaut_esp32.menu.FlashFreq.80=80MHz
exonaut_esp32.menu.FlashFreq.80.build.flash_freq=80m
exonaut_esp32.menu.FlashFreq.40=40MHz
exonaut_esp32.menu.FlashFreq.40.build.flash_freq=40m

# Flash Size
exonaut_esp32.menu.FlashSize.4M=4MB (32Mb)
exonaut_esp32.menu.FlashSize.4M.build.flash_size=4MB
exonaut_esp32.menu.FlashSize.8M=8MB (64Mb)
exonaut_esp32.menu.FlashSize.8M.build.flash_size=8MB
exonaut_esp32.menu.FlashSize.16M=16MB (128Mb)
exonaut_esp32.menu.FlashSize.16M.build.flash_size=16MB

# Upload Speed
exonaut_esp32.menu.UploadSpeed.921600=921600
exonaut_esp32.menu.UploadSpeed.921600.upload.speed=921600
exonaut_esp32.menu.UploadSpeed.115200=115200
exonaut_esp32.menu.UploadSpeed.115200.upload.speed=115200
exonaut_esp32.menu.UploadSpeed.230400=230400
exonaut_esp32.menu.UploadSpeed.230400.upload.speed=230400

# Debug Level
exonaut_esp32.menu.DebugLevel.none=None
exonaut_esp32.menu.DebugLevel.none.build.code_debug=0
exonaut_esp32.menu.DebugLevel.error=Error
exonaut_esp32.menu.DebugLevel.error.build.code_debug=1
exonaut_esp32.menu.DebugLevel.warn=Warn
exonaut_esp32.menu.DebugLevel.warn.build.code_debug=2
exonaut_esp32.menu.DebugLevel.info=Info
exonaut_esp32.menu.DebugLevel.info.build.code_debug=3
exonaut_esp32.menu.DebugLevel.debug=Debug
exonaut_esp32.menu.DebugLevel.debug.build.code_debug=4
exonaut_esp32.menu.DebugLevel.verbose=Verbose
exonaut_esp32.menu.DebugLevel.verbose.build.code_debug=5

# Erase Flash
exonaut_esp32.menu.EraseFlash.none=Disabled
exonaut_esp32.menu.EraseFlash.none.upload.erase_cmd=
exonaut_esp32.menu.EraseFlash.all=Enabled
exonaut_esp32.menu.EraseFlash.all.upload.erase_cmd=-e
